pandas full form ->python data analysis library
Pandas is a Python library used for working with data sets.
It has functions for analyzing, cleaning, exploring, and manipulating data.
The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

# Why Use Pandas?
Pandas allows us to analyze big data and make conclusions based on statistical theories.

Pandas can clean messy data sets, and make them readable and relevant.

Relevant data is very important in data science.

# What Can Pandas Do?
Pandas gives you answers about the data. Like:

Is there a correlation between two or more columns?
What is average value?
Max value?
Min value?
Pandas are also able to delete rows that are not relevant, or contains wrong values, like empty or NULL values. This is called cleaning the data.

# first we need to import the pandas package

In [6]:
import pandas as pd
import numpy as np

# Series use is it shows the index order based on the given data
It is the one dimensional data 
A Pandas Series is like a column in a table.

In [156]:
series=pd.Series(np.arange(15,27))
series

0     15
1     16
2     17
3     18
4     19
5     20
6     21
7     22
8     23
9     24
10    25
11    26
dtype: int32

# reterieving the single value using index

In [157]:
series[1]

16

here from the above series we can observe that range follows n-1 i.e it shows the values from 15 -27

# Giving names to the index

In [158]:
index_names=pd.Series(np.arange(0,11),index=['row1','row2','row3','row4','row5','row6','row7','row8','row9','row10','row11'])
index_names

row1      0
row2      1
row3      2
row4      3
row5      4
row6      5
row7      6
row8      7
row9      8
row10     9
row11    10
dtype: int32

# what happens if we give length of the range values are not equal to Index length?

In [159]:
index_names=pd.Series(np.arange(0,11),index=['row1','row2','row3','row4','row5','row6','row7','row8','row9','row10'])
index_names

ValueError: Length of passed values is 11, index implies 10.

from the above "length of passed values is 11,index implies 10" that means length of the range values are 11 so we must give 11 indexes.

# slicing based on position based indexing
It follows 0 to n-1

In [160]:
index_names[0:4]#[0:4] are not indicating the values ,it indicates the index positions

row1    0
row2    1
row3    2
row4    3
dtype: int32

In [161]:
index_names[1:6]

row2    1
row3    2
row4    3
row5    4
row6    5
dtype: int32

from above we can say that [1:6] ->are the index positions because row2 index position is 1,row 6 index position is 5

# Retrieving the records or the data by using label index(naming the index)
it doesnt follow 0 to n-1 rule because we are calling it by the index names

In [162]:
index_names['row3':'row8']# here we must give apstropy to the 'row3':'row4' beacuse they are string type

row3    2
row4    3
row5    4
row6    5
row7    6
row8    7
dtype: int32

In [163]:
index_names['row2':'row2']

row2    1
dtype: int32

In [164]:
index_names['row3':'row4']

row3    2
row4    3
dtype: int32

# reterieve the  single value by using  index

In [165]:
index_names['row2']

1

In [166]:
index_names['row3']

2

In [167]:
print(index_names[0])

0

In [168]:
array=np.array(['numpy','pandas','matplotlib','seaborn','3.8'])
print(array)
array[1]

['numpy' 'pandas' 'matplotlib' 'seaborn' '3.8']

'pandas'

from the above line of the code we observed it doesnt follow the index beacuse it is an array.

# passing an array in the series

In [169]:
data=pd.Series(array)
data
#data=pd.Series(np.array(['numpy','python','matplotlib','seaborn','3.8']))

0         numpy
1        pandas
2    matplotlib
3       seaborn
4           3.8
dtype: object

In [170]:
data[0]

'numpy'

In [171]:
df=np.array([np.arange(10,20)])
df

array([[10, 11, 12, 13, 14, 15, 16, 17, 18, 19]])

# pandas Data Frame

Data sets in Pandas are usually multi-dimensional tables, called DataFrames.

Series is like a column, a DataFrame is the whole table.

                      or 
A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

# we can  DataFrame by numpy ndArrays or lists or Dictionaries or Series

In [172]:
df=pd.DataFrame(np.arange(0,50).reshape(10,5))
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
5  25  26  27  28  29
6  30  31  32  33  34
7  35  36  37  38  39
8  40  41  42  43  44
9  45  46  47  48  49

# giving columns names and row names(index)

In [173]:
indx=['row1','row2','row3','row4','row5','row6','row7']
col=['col1','col2','col3','col4','col5','col6','col7']
name=pd.DataFrame(np.arange(49).reshape(7,7),index=['row1','row2','row3','row4','row5','row6','row7'],columns=['col1','col2','col3','col4','col5','col6','col7'])
name

      col1  col2  col3  col4  col5  col6  col7
row1     0     1     2     3     4     5     6
row2     7     8     9    10    11    12    13
row3    14    15    16    17    18    19    20
row4    21    22    23    24    25    26    27
row5    28    29    30    31    32    33    34
row6    35    36    37    38    39    40    41
row7    42    43    44    45    46    47    48

# reterieving the data using loc and iloc

# Locate Named Indexes
Use the named index in the loc attribute to return the specified row(s).

In [174]:
name.loc['row2':'row6','col5']#based on names of the given rows it prints the values

row2    11
row3    18
row4    25
row5    32
row6    39
Name: col5, dtype: int32

In [175]:
name.loc['row2':'row5','col5':'col7']

      col5  col6  col7
row2    11    12    13
row3    18    19    20
row4    25    26    27
row5    32    33    34

   # or

In [176]:
name.loc[['row2','row4'],['col3','col6']]

      col3  col6
row2     9    12
row4    23    26

In [177]:
#if you want to get all the row values then:
name.loc['row6']

col1    35
col2    36
col3    37
col4    38
col5    39
col6    40
col7    41
Name: row6, dtype: int32

In [178]:
#if you want to get the all the values in one column
name.loc[:'row2']

      col1  col2  col3  col4  col5  col6  col7
row1     0     1     2     3     4     5     6
row2     7     8     9    10    11    12    13

# iloc -> iloc function is mainly applied for integer indexing

In [98]:
name.iloc[1:7,5]

row2    12
row3    19
row4    26
row5    33
row6    40
row7    47
Name: col6, dtype: int32

In [119]:
name.iloc[1:5,0:6]

      col1  col2  col3  col4  col5  col6
row2     7     8     9    10    11    12
row3    14    15    16    17    18    19
row4    21    22    23    24    25    26
row5    28    29    30    31    32    33

In [120]:
#if you want to print the specific element or value

In [123]:
name.loc['row2']['col3']#we should name the row and column in loc function

9

In [136]:
name.loc['row3':'row4']

      col1  col2  col3  col4  col5  col6  col7
row3    14    15    16    17    18    19    20
row4    21    22    23    24    25    26    27

In [143]:
name.loc[:,'col3':'col5']

      col3  col4  col5
row1     2     3     4
row2     9    10    11
row3    16    17    18
row4    23    24    25
row5    30    31    32
row6    37    38    39
row7    44    45    46

In [125]:
name.iloc[1][2]#we should give position of the row and column in iloc function

9

In [127]:
name.loc[:,]#it selects the all rows and columns

      col1  col2  col3  col4  col5  col6  col7
row1     0     1     2     3     4     5     6
row2     7     8     9    10    11    12    13
row3    14    15    16    17    18    19    20
row4    21    22    23    24    25    26    27
row5    28    29    30    31    32    33    34
row6    35    36    37    38    39    40    41
row7    42    43    44    45    46    47    48

In [128]:
type(name)

pandas.core.frame.DataFrame

# creating data frame by dictionaries

In [93]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [94]:
keys={"length":[100,75,80],"width":[25,20,15]}
keys1=pd.DataFrame(keys,index=[1,2,3])
keys1

   length  width
1     100     25
2      75     20
3      80     15

In [148]:
df1=pd.DataFrame(np.random.rand(10,10),index=pd.date_range('1/1/2020',periods=10),columns=list('1234567895'))
df1

,1,2,3,4,5,6,7,8,9,5
2020-01-01,0.158678,0.740656,0.795153,0.398392,0.825025,0.795961,0.413108,0.437437,0.340661,0.301592
2020-01-02,0.997514,0.043791,0.288872,0.535519,0.580941,0.104951,0.185571,0.577019,0.408750,0.796072
2020-01-03,0.702983,0.414371,0.007035,0.031150,0.624985,0.724603,0.878925,0.391504,0.479417,0.212944
2020-01-04,0.169390,0.365102,0.348888,0.960163,0.843396,0.505982,0.006914,0.200531,0.993238,0.803466
2020-01-05,0.939246,0.486615,0.248107,0.778488,0.117042,0.170189,0.627905,0.268848,0.841718,0.077453
2020-01-06,0.902193,0.813260,0.463494,0.566720,0.889025,0.243988,0.653922,0.822367,0.128138,0.826286
2020-01-07,0.398675,0.218215,0.631275,0.062594,0.548688,0.542594,0.200769,0.412641,0.683726,0.771218
2020-01-08,0.853644,0.186776,0.270572,0.976131,0.931128,0.126608,0.729803,0.951792,0.725304,0.516662
2020-01-09,0.599119,0.486874,0.843731,0.261427,0.133642,0.738346,0.907527,0.061318,0.222392,0.943257
2020-01-10,0.573663,0.366013,0.283357,0.864225,0.746717,0.686109,0.528096,0.107985,0.930801,0.525778

# Load Files Into a DataFrame
If your data sets are stored in a file, Pandas can load them into a DataFrame.

Example

In [ ]:
df = pd.read_csv('data.csv')

print(df)

# Pandas - Analyzing DataFrames

# Tip: use to_string() to print the entire DataFrame.

By default, when you print a DataFrame, you will only get the first 5 rows, and the last 5 rows:

In [150]:
import seaborn as sns
df=sns.load_dataset('iris')
df.head()# head() it prints first first rows

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [151]:
df.tail()# 5t prints the last 5 rows

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

# Info About the Data
The DataFrames object has a method called info(), that gives you more information about the data set.

In [152]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

# Null Values
The info() method also tells us how many Non-Null values there are present in each column, and in our data set it seems like there are no null values

Empty values, or Null values, can be bad when analyzing data, and you should consider removing rows with empty values. This is a step towards what is called cleaning data, and you will learn more about that in the next chapters.

In [153]:
df.isnull()

     sepal_length  sepal_width  petal_length  petal_width  species
0           False        False         False        False    False
1           False        False         False        False    False
2           False        False         False        False    False
3           False        False         False        False    False
4           False        False         False        False    False
..            ...          ...           ...          ...      ...
145         False        False         False        False    False
146         False        False         False        False    False
147         False        False         False        False    False
148         False        False         False        False    False
149         False        False         False        False    False

[150 rows x 5 columns]

In [155]:
df.isnull().sum()# isnull().sum() shows the how mAany and what are they in the dataframe

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64